import re


def capital_text(s):
    result = s.strip().capitalize()
    result = re.sub(r'(?<=[.!?])\s*.', lambda x: x.group().upper(), result)

    return result


text = 'дуже часто? люди у своїх повідомленнях не ставлять великі літери! особливо це стало масовим явищем в еру мобільних. пристроїв. розробіть функцію'

print(capital_text(text))



'''
Дуже часто люди у своїх повідомленнях не ставлять великі літери, особливо це стало масовим явищем в еру мобільних. пристроїв.
Розробіть функцію capital_text, яка прийматиме на вхід рядок з текстом і повертатиме рядок з відновленими великими літерами.

Функція повинна:

зробити великою першу літеру в рядку, попри прогалини
зробити великою першу літеру після точки, попри прогалини
зробити великою першу літеру після знака оклику, попри прогалини
зробити великою першу літеру після знака питання, попри прогалини
'''