def decode(data): 
    if not data: 
        return []
    
    result = []
    
    if len(data) == 1:
        return data
    else:
        for i in range(len(data)):
            if isinstance(data[i], int):
                for k in range(data[i]):
                    result.extend(decode(data[i - 1]))

    return result
        
    
# Приклад використання
encoded_list = ["X", 3, "Z", 2, "X", 2, "Y", 3, "Z", 2]
# encoded_list = ["X"]
decoded_list = decode(encoded_list)
print(decoded_list)



'''
Розберемо просту техніку кодування та декодування на основі серій.
Наприклад, у нас є список із повторюваними спостереженнями якоїсь величини, вона може приймати значення X, Y або Z.
Значення з'являються у довільному порядку та зберігаємо ми їх у списку
["X", "X", "X", "Z", "Z", "X", "X", "Y", "Y", "Y", "Z", "Z"] або рядку "XXXZZXXYYYZZ".

Внаслідок чого ми можемо зменшити обсяг інформації, що зберігається?
Стиснення можна досягти заміною групи повторюваних значень на одноразове значення та лічильник повторів:
["X", 3, "Z", 2, "X", 2, "Y", 3, "Z", 2]

Напишіть рекурсивну функцію decode для декодування списку, закодованого цим способом.
Як аргумент функція приймає закодований список. Функція має повернути розшифрований список елементів.
'''