def sequence_buttons(string):

    char_to_button = {
        '.': '1', ',': '11', '?': '111', '!': '1111', ':': '11111',
        'A': '2', 'B': '22', 'C': '222',
        'D': '3', 'E': '33', 'F': '333',
        'G': '4', 'H': '44', 'I': '444',
        'J': '5', 'K': '55', 'L': '555',
        'M': '6', 'N': '66', 'O': '666',
        'P': '7', 'Q': '77', 'R': '777', 'S': '7777',
        'T': '8', 'U': '88', 'V': '888',
        'W': '9', 'X': '99', 'Y': '999', 'Z': '9999',
        ' ': '0'
    }

    string = string.upper()
    result = ''

    for char in string:
        if char in char_to_button:
            button_sequence = char_to_button[char]
            result += button_sequence

    return result


input_text = "Hello, World!"
button_sequence = sequence_buttons(input_text)
print(button_sequence)



'''
Як ви знаєте, раніше телефони були з кнопками, та й зараз вони є подекуди у вжитку.
Тоді текстові повідомлення набиралися за допомогою цифрових кнопок.
Як інженери телефонів створили набір тексту?
Рішення було в тому, що одна кнопка була асоційована одночасно з декількома літерами,
а вибір залежав від кількості натискань на кнопку.
Одноразове натискання призводило до появи першої літери у відповідному цій кнопці списку,
наступні натискання змінювали її на наступну.

Символи, що відповідають кнопкам на телефонах

Кнопка	Символи
1	. , ? ! :
2	A B C
3	D E F
4	G H I
5	J K L
6	M N O
7	P Q R S
8	T U V
9	W X Y Z
0	Пробіл
Напишіть функцію sequence_buttons, що показує послідовність кнопок, яку необхідно натиснути,
щоб на екрані телефону з'явився текст, введений користувачем.

Створіть словник, який відповідає символам з кнопками, які потрібно натиснути.

Приклад: якщо функції sequence_buttons передати рядок "Hello, World!", функція повинна повернути "4433555555666110966677755531111".

Вимоги:

функція коректно обробляє малі та великі літери.
функція ігнорує символи, що не входять до зазначеного списку
'''